Tekla Open API Reference for Tekla Structures 2025
Parallel.VectorToPlane Method (Vector, GeometricPlane, Double)
 Returns true if the given vector and plane are parallel within the given angular tolerance.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool VectorToPlane(
	Vector Vector,
	GeometricPlane Plane,
	double Tolerance
)
Public Shared Function VectorToPlane (
	Vector As Vector,
	Plane As GeometricPlane,
	Tolerance As Double
) As Boolean
Parameters
Vector
Type: Tekla.Structures.Geometry3d.Vector
The vector to be used.
Plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Tolerance
Type: System.Double
The angular tolerance (in radians) to be used.
Return Value
Type: Boolean
True if the given vector and plane are parallel within the given tolerance.
See Also
Reference
Parallel Class
VectorToPlane Overload
Tekla.Structures.Geometry3d Namespace